//
//  SummonAggregate_Player1Tag.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/07/31.
//
//

#ifndef SummonAggregate_Player1Tag_hpp
#define SummonAggregate_Player1Tag_hpp

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "SummonAggregate.hpp"

//=========================================================================
// 前方宣言
//=========================================================================
class CSummon ;

//=========================================================================
//
// 召喚キャラ集合_プレイヤー１
//
//=========================================================================
class CSummonAggregate_Player1Tag : public CSummonAggregate {
public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   コンストラクタ
     */
    CSummonAggregate_Player1Tag(std::vector<CSummon*> *pAggre) ;
    
    /**
     *  @desc   デストラクタ
     */
    ~CSummonAggregate_Player1Tag() ;
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   開始イテレーターの取得
     *  @return イテレーター
     */
    virtual std::shared_ptr<CIteratorTemplate<CSummon*>> iterator() override ;
    
};

#endif /* SummonAggregate_Player1Tag_hpp */
