//
//  LaunchTemplate.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/07/25.
//
//

#ifndef LaunchTemplate_hpp
#define LaunchTemplate_hpp

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "LaunchDatas.hpp"

//=========================================================================
//
// 発射テンプレート
// テンプレートの型を生成して返す
// 生成に引数が必要な場合や特殊な生成をする場合は
// LaunchDataテンプレートクラスに登録をして、 Ty *launch()部分特殊化させる
//
//=========================================================================
template<typename Ty>
class CLaunch {
public :
    //=========================================================================
    // 追加のインクルードはここから
    //=========================================================================
    /**
     *  @desc   コンストラクタ
     */
    CLaunch(CLaunchData<Ty> *pData) ;
    
    /**
     *  @desc   デストラクタ
     */
    ~CLaunch() ;
    
    //=========================================================================
    // get
    //=========================================================================
    /**
     *  @desc   発射したかどうか
     *  @return true...発射した false...発射していない
     */
    inline bool isLaunched(){return this->m_isLaunched ;}
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   テンプレートの型を生成して返す
     */
    Ty *launch() ;
    
protected :
    //=========================================================================
    // メンバ変数
    //=========================================================================
    // 発射したかどうか
    bool m_isLaunched = false ;
    // 発射データ
    CLaunchData<Ty> *m_pData {NULL} ;
};

#endif /* LaunchTemplate_hpp */
