//
//  EndScene.cpp
//  Shirodora
//
//  Created by 今西一喜 on 2016/08/16.
//
//

#include "EndScene.hpp"

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "Constants.hpp"
#include "End_MainLayer.hpp"
#include "End_UILayer.hpp"


//=========================================================================
//
// CTitleScene
//
//=========================================================================
//=========================================================================
// コンストラクタ/デストラクタ
//=========================================================================
/**
 *  @desc   constructor
 */
CEndScene::CEndScene(){}

/**
 *  @desc   destructor
 */
CEndScene::~CEndScene(){
}

//=========================================================================
// init
//=========================================================================
/**
 *  @desc   init
 */
bool CEndScene::init(){
    if(cocos2d::Scene::init() == false) return false ;
    
    // メインレイヤーの生成と取り付け
    this->m_pMainLayer = CCREATE_FUNC::create<CEnd_MainLayer>() ;
    this->addChild(this->m_pMainLayer) ;
    
    // UIレイヤー
    this->m_pUILayer = CCREATE_FUNC::create<CEnd_UILayer>() ;
    addChild(m_pUILayer);
    
    // スケジューラーに登録
    this->scheduleUpdate() ;
    
    return true ;
}

//=========================================================================
// set
//=========================================================================


//=========================================================================
// get
//=========================================================================


//=========================================================================
// メンバ関数
//=========================================================================
/**
 *  @desc   update
 *  @param  微小時間
 */
void CEndScene::update(float deltaTime){
}

