//
//  GameMainLayer.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/07/03.
//
//

#ifndef GameMainLayer_hpp
#define GameMainLayer_hpp

#include <stdio.h>

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "InputAndMouseLayer.hpp"

//=========================================================================
// 前方宣言
//=========================================================================
class CCharacter ;

//=========================================================================
//
// Battele_MainLayer
//
//=========================================================================
class CBattele_MainLayer : public CInputAndMouseLayer {
public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   constructor
     */
    CBattele_MainLayer() ;
    
    /**
     *  @desc   destructor
     */
    virtual ~CBattele_MainLayer() ;
    
    //=========================================================================
    // init
    //=========================================================================
    /**
     *  @desc   init
     */
    virtual bool init() override ;
    
    //=========================================================================
    // set
    //=========================================================================
    
    //=========================================================================
    // get
    //=========================================================================
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   update
     *  @param  微小時間
     */
    virtual void update(float deltaTime) override ;
    
    /**
     *  @desc   集合体からのスプライトの取り外し
     *  @param  集合体
     */
    template <typename Ty>
    void checkAndRemove(std::vector<Ty*> *pVector) ;
    
    
    /**
     *  @desc   レイヤーのスクロール
     */
    void scroll();
    
    /**
     *  @desc   入力処理
     */
    void inputFunc();
    
    //=========================================================================
    // メンバ変数
    //=========================================================================
    // !!!:テスト用マウスカーソルスプライト
    cocos2d::Sprite *m_pCursor {NULL} ;
    
    // TODO:多分画面スクロール時にいる気がする
    // カメラ座標
    cocos2d::Vec2 m_cameraPosition ;
    
    // キャラクター集合体
    std::vector<CCharacter*> *m_pCharacters {NULL} ;
    
    //ゲームモード
    int m_gameMode = 0;
    
};

#endif /* GameMainLayer_hpp */
