//
//  Trigger_Timer.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/07/26.
//
//

#ifndef Trigger_Timer_hpp
#define Trigger_Timer_hpp

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "TriggerTemplateBase.hpp"

//=========================================================================
//
// トリガー_タイマー
//
//=========================================================================
template<typename Ty>
class CTrigger_Timer : public CTriggerTemplateBase<Ty> {
public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   コンストラクタ
     */
    CTrigger_Timer(CLaunchData<Ty> *pData, int limit) ;
    
    /**
     *  @desc   デストラクタ
     */
    ~CTrigger_Timer() ;
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   設定されているトリガーが発動できるかどうか
     *  @param  true...できる false...できない
     */
    bool isReady() override ;
    
    /**
     *  @desc   トリガー更新処理
     */
    void update() override ;
    
protected :
    //=========================================================================
    // メンバ変数
    //=========================================================================
    // 発射限界時間
    const int m_limite ;
    // カウンター
    int m_counter = 0 ;
};

#endif /* Trigger_Timer_hpp */
