//
//  LaunchTrigger.hpp
//  BarrageGame
//
//  Created by Ryoutarou Onimura on 2016/07/13.
//
//

#ifndef LaunchTrigger_hpp
#define LaunchTrigger_hpp

#include <stdio.h>

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
class CPawn ;

//=========================================================================
//
// LaunchTrigger
// 各種トリガークラスの基礎
// template には発射するものの型を入れる
//
//=========================================================================
template<typename Ty = CPawn>
class CLaunchTrigger {
public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   destructor
     */
    virtual ~CLaunchTrigger(){}
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   発射したかどうか
     *  @return true...発射した false...発射してない
     */
    inline virtual bool isLaunched(){return this->m_isLaunched ; }
    
    /**
     *  @desc   設定されているトリガーが発動できるかどうか
     *  @param  true...できる false...できない
     */
    virtual bool isReady() = 0 ;
    
    /**
     *  @desc   トリガーの発射
     *  preturn 出撃させるもの
     */
    virtual Ty *launch() = 0 ;
    
protected :
    //=========================================================================
    // メンバ変数
    //=========================================================================
    // 発射したかどうか
    bool m_isLaunched = false ;
    
};

#endif /* LaunchTrigger_hpp */
