//
//  SummonAggregate.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/07/31.
//
//

#ifndef SummonAggregate_hpp
#define SummonAggregate_hpp

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "AggregateTemplate.hpp"

//=========================================================================
// 前方宣言
//=========================================================================
class CSummon ;

//=========================================================================
//
// 召喚キャラ集合
//
//=========================================================================
class CSummonAggregate : public IAggregateTemplate<CSummon*> {
public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   コンストラクタ
     */
    CSummonAggregate(std::vector<CSummon*> *pAggre) ;
    
    /**
     *  @desc   デストラクタ
     */
    virtual ~CSummonAggregate() ;
    
    //=========================================================================
    // get
    //=========================================================================
    /**
     *  @desc   最大サイズの取得
     */
    inline virtual int getSize() override {return this->m_pAggregate->size() ;}
    
    /**
     *  @desc   要素の取得
     *  @param  添字番号
     */
    inline virtual CSummon *getAt(int index) override {return (*this->m_pAggregate)[index] ;}
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   開始イテレーターの取得
     *  @return イテレーター
     */
    virtual std::shared_ptr<CIteratorTemplate<CSummon*>> iterator() override ;
    
protected :
    //=========================================================================
    // メンバ変数
    //=========================================================================
    // 集合体
    std::vector<CSummon*> *m_pAggregate {NULL} ;
};

#endif /* SummonAggregate_hpp */
