//
//  EnemySpawnAlgorithm_Base.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/08/27.
//
//

#ifndef EnemySpawnAlgorithm_Base_hpp
#define EnemySpawnAlgorithm_Base_hpp

//=========================================================================
// 追加のインクルードはここから
//=========================================================================

//=========================================================================
// 前方宣言
//=========================================================================
class CSummon ;
template <typename Ty>
class CLaunchData ;

//=========================================================================
//
//
//
//=========================================================================
class CEnemySpawnAlgorithm_Base {
public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   コンストラクタ
     */
    CEnemySpawnAlgorithm_Base(int waitTime) ;
    
    /**
     *  @desc   デストラクタ
     */
    virtual ~CEnemySpawnAlgorithm_Base() ;
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   更新処理
     */
    virtual void update(int time, int cost) = 0;
    
    /**
     *  @desc   敵のランチデータを返す
     *  @param  時間
     *  @param  コスト
     */
    virtual void launchEnemy(int time, int cost) = 0 ;
    
protected :
    //=========================================================================
    // メンバ変数
    //=========================================================================
    // 待ち時間
    const int m_waitTime ;
    // カウンター
    int m_counter = 0 ;
    
};

#endif /* EnemySpawnAlgorithm_Base_hpp */
