//
//  TriggerTemplate_Normal.hpp
//  BarrageGame
//
//  Created by Ryoutarou Onimura on 2016/07/14.
//
//

#ifndef TriggerTemplate_Normal_hpp
#define TriggerTemplate_Normal_hpp

#include <stdio.h>

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "TriggerTemplate.hpp"

//=========================================================================
//
// CTriggerTemplate_Normal
// 即時発射型トリガー
//
//=========================================================================
template<typename Ty = CPawn>
class CTriggerTemplate_Normal : public CTriggerTemplate<Ty> {
public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   destructor
     */
    virtual ~CTriggerTemplate_Normal(){}
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   設定されているトリガーが発動できるかどうか
     *  @return true...できる false...できない
     *  @tips   取り付けられたら即発射するタイプ
     */
    virtual bool isReady() override {return true ;}
    
protected :
    //=========================================================================
    // メンバ変数
    //=========================================================================
    
};

#endif /* TriggerTemplate_Normal_hpp */
