//
//  TitleScene.cpp
//  Shirodora
//
//  Created by 今西一喜 on 2016/08/13.
//
//

#include "TitleScene.hpp"

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "Constants.hpp"
#include "Title_MainLayer.hpp"
#include "Title_UILayer.hpp"


//=========================================================================
//
// CTitleScene
//
//=========================================================================
//=========================================================================
// コンストラクタ/デストラクタ
//=========================================================================
/**
 *  @desc   constructor
 */
CTitleScene::CTitleScene(){}

/**
 *  @desc   destructor
 */
CTitleScene::~CTitleScene(){
}

//=========================================================================
// init
//=========================================================================
/**
 *  @desc   init
 */
bool CTitleScene::init(){
    if(cocos2d::Scene::init() == false) return false ;
    
    // メインレイヤーの生成と取り付け
    this->m_pMainLayer = CCREATE_FUNC::create<CTitle_MainLayer>() ;
    this->addChild(this->m_pMainLayer) ;
    
    // UIレイヤー
    this->m_pUILayer = CCREATE_FUNC::create<CTitle_UILayer>() ;
    addChild(m_pUILayer);
    
    // スケジューラーに登録
    this->scheduleUpdate() ;
    
    return true ;
}

//=========================================================================
// set
//=========================================================================


//=========================================================================
// get
//=========================================================================


//=========================================================================
// メンバ関数
//=========================================================================
/**
 *  @desc   update
 *  @param  微小時間
 */
void CTitleScene::update(float deltaTime){
}



