//
//  LaunchDatas.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/07/25.
//
//

#ifndef LaunchDatas_hpp
#define LaunchDatas_hpp

//=========================================================================
// 前方宣言
//=========================================================================
class CSummon ;

enum class SUMMON_TYPE ;


//=========================================================================
//
// 発射データテンプレート
//
//=========================================================================
template<typename Ty>
class CLaunchData {
public :
    
};

//=========================================================================
//
// プレイヤーユニット発射データ
//
//=========================================================================
template<>
class CLaunchData<CSummon> {
public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   コンストラクタ
     */
    CLaunchData(int tag, SUMMON_TYPE type, float posX, float posY) :
    tag(tag), type(type), posX(posX), posY(posY){}
    
    //=========================================================================
    // メンバ変数
    //=========================================================================
    int tag ;
    SUMMON_TYPE type ;
    float posX ;
    float posY ;
    
};


#endif /* LaunchDatas_hpp */
