//
//  SummonIterator_Player1Tag.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/07/31.
//
//

#ifndef SummonIterator_Player1Tag_hpp
#define SummonIterator_Player1Tag_hpp

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "AggregateTemplate.hpp"

//=========================================================================
// 前方宣言
//=========================================================================
class CSummon ;

//=========================================================================
//
// 召喚キャライテレーター_プレイヤー１タグ
//
//=========================================================================
class CSummonIterator_Player1Tag : public CIteratorTemplate<CSummon*> {
public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   コンストラクタ
     */
    CSummonIterator_Player1Tag(IAggregateTemplate<CSummon*> *pAggre) ;
    
    /**
     *  @desc   デストラクタ
     */
    ~CSummonIterator_Player1Tag() ;
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   次が存在するかどうかをチェック
     *  @return true...次がある false...次がない
     */
    bool hasNext() override ;
    
};

#endif /* SummonIterator_Player1Tag_hpp */
