//
//  SummonLauncher.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/07/17.
//
//

#ifndef SummonLauncher_hpp
#define SummonLauncher_hpp

#include <stdio.h>

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "LauncherTemplate.hpp"

//=========================================================================
// 前方宣言
//=========================================================================
class CSummon ;

//=========================================================================
//
// SummonLauncher
//
//=========================================================================
class CSummonLauncher : public CLauncher<CSummon> {
    public :
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
    /**
     *  @desc   constructor
     */
    CSummonLauncher(cocos2d::Layer *pLayer) ;
    
    /**
     *  @desc   destructor
     */
    ~CSummonLauncher() ;
    
    private :
    //=========================================================================
    // メンバ関数
    //=========================================================================
    /**
     *  @desc   発射
     */
    virtual void launch() override ;
};

#endif /* SummonLauncher_hpp */
